export const TEXTURA_THUMBNAIL_MOCK = 'https://api.time.com/wp-content/uploads/2019/11/fish-with-human-face-tik-tok-video.jpg?w=800&quality=85';
export const AUTHOR_PROFILE_IMAGE_MOCK = 'https://scontent.fhfa2-2.fna.fbcdn.net/v/t1.0-9/66177248_3115300808694945_7500105559970938880_n.jpg?_nc_cat=106&_nc_ohc=OzMUeA6ArDkAX86LWMx&_nc_ht=scontent.fhfa2-2.fna&oh=c1c24d75690c093c5d2e0d3388244af9&oe=5E99FA21';

export const LOREM_IPSUM = `לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.
להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט. קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף ושבעגט ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי.
קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט
ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי.
גולר מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס.
קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. קונדימנטום קורוס בליקרה, נונסטי קלובר בריקנה סטום, לפריקך תצטריק לרטי.
קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה ברורק.
`;

export const STORY_MOCK = `
פרק אחת – פיש והדגה.

היה היה פעם דג מיוחד במינו, שהכל קראוהו פיש.
פיש נולד בחוות גידול לדגים, והיה דג קטן ולחוץ מאוד. בכל פעם שהוא ראה את הרשת הענקית הזו באה ולוקחת את כל החברים, האחים והמשפחה שלו, הוא היה נדחק לפינה כמה שיותר ולא זז משם עד שהרשת היתה הולכת לה. אימו אמרה לו, וכך גם הוא האמין, שהפינה תעניק לו ביטחון. הגנה. 
פיש היה דג מהיר מאוד, כך שתמיד הגיע לפינה ראשון, ובכך היה בטוח שהעניק לעצמו את החסינות המקסימלית. אבל מה שהוא לא ידע, ומה שאף דג בחוות הדגים לא ידע, זה שאי אפשר לחמוק מן הרשת. אפשר לעכב את גזר הדין, כן, אבל אי אפשר לחמוק ממנה. לא ולא.
פיש זכר היטב את היום בו הרשת לכדה אותו. 
הוא בדיוק אכל ולא שם לב – וזה הגיע אליו פשוט כמו מכת ברק מהירה ומעוורת. 
כשהוא ניסה לברוח במהירות זה כבר היה מאוחר מדי – הוא היה עמוק בפנים, דחוס יחד עם חבריו, אחיו ומשפחתו, והתרומם מעלה, אל גזר הדין. 
גזר הדין ערך ארבע שניות. 
פיש זוכר את השניות הללו כשניות הנוראות ביותר בחייו. הוא לא היה יכול לנשום ולא היה יכול לזוז. הוא ניסה לקפוץ וניסה לשחות וניסה לקלוט לתוך גופו מים מתוקים שיעניקו לו את טעם החיים אבל כלום. רק יובש ומחנק חדרו אליו ומילאו אותו ודחסו אותו עד שהיה נדמה לו שעיניו עומדות להתפוצץ. 
אבל ארבע השניות חולפות, ובשניה החמישית הוא מרגיש איך החיים חוזרים אליו יחד עם מים אחרים שהוא לא מכיר. הוא נושם שוב. הוא חי. 
ואחרי זה – טלטלות. הרבה מאוד טלטלות. פיש מטלטל מפה לשם, קופץ ממקום למקום, עובר ממים כאלו לאחרים בתכיפות שהולכת וגדלה. 
עד שהוא מגיע למקום ממש מואר וגדול, בניגוד לחווה שהייתה חשוכה ודחוסה. הוא מתגעגע לחבריו, אחיו ומשפחתו. אף אחד מהם לא כאן, איתו. הוא מתגעגע והאור מסנוור אותו. 


פרק שתיים – פיש וראיין.

כשהוא רואה אותו, זו אהבה ממבט ראשון.
"אמא אמא בבקשה אותו אני רוצה אותו בבקשה!" ראיין מאבד את כל האשתונות ותכף דעתו תשתבש עליו. הוא רואה את הדג עם הכתם השחור לבן שעל גבו, ומתאהב בו שוב ושוב. "אותו אותו אני רוצה אותו!" 
אמא ממהרת להרגיע ואומרת שניקח אותו אותו ורק אותו. המוכר לוקח את הרשת ומוציא את הדג עם הכתם השחור לבן מהמים והדג מפרפר עד שהוא מוכנס למים חדשים, בשקית אותה נותן המוכר לראיין. 
"איך קוראים לו??" ראיין שואל בהתלהבות אינסופית. 
"קוראים לו פיש." המוכר אומר, וראיין מתאהב מיד גם בשם.
"פיש פיש פיש," הוא קורא כל הדרך הביתה, וכל הדרך לאקווריום שהם קנו במיוחד בשביל פיש. הוא ממשיך לשיר את שמו גם כאשר הוא מביט בפיש שוחה באקווריום, ורואה כיצד הוא מנסה לבחון את הסביבה החדשה אליה הגיע, נבהל בכל פעם שראיין מצמיד את ראשו לזכוכית וצוחק. 
פיש לא אוכל בהתחלה מהאוכל שמביאים לו, אבל זה משתנה במהרה. ראיין מביט בו ומאושר, והוא בטוח שגם פיש מאושר. איך פיש לא יכול להיות מאושר אם ראיין מאושר? זה לא אפשרי. 


פרק שלוש – פיש והבעיה. 

פיש גדל לו באקווריום של ראיין, ולאחר ימים ספורים בלבד הכל מבחינים בבעיה.
אמא מתקרבת אל האקווריום ואומרת, "זה דג גדול."
אבא מתקרב אל האקווריום ואומר, "למה קניתם דג כל כך גדול?"
אחותו של ראיין מתקרבת לאקווריום ואומרת, "מה זה הוא בקושי יכול לזוז!"
ואחיו הקטן של ראיין לא מתקרב אל האקווריום כלל, כי כל פעם שהוא מתקרב הגודל של פיש מפחיד אותו והוא בוכה.
וראיין, ראיין לא מבין בכלל. כי רק לפני כמה ימים פיש היה כזה קטן, ופתאום הוא כבר תופס את כל האקווריום. 
הוא ואמא חוזרים לחנות כשפיש כבר נמחץ אל הזכוכית והיא אומרת למוכר, "תראה, מכרת לי דג חולה!"
והמוכר צוחק ואומר, "חולה! הוא בריא כמו שור, תראי את הגודל שלו! איפה קנית?"
"מה עושים?" אמא של ראיין חסרת כל ישע. 
והמוכר מציע את הפתרון האולטימטיבי – "תקנו אקווריום יותר גדול!" 
ראיין צוהל אבל אמא לא מרוצה. "זה המון כסף." היא טוענת. "תעשה לנו הנחה."
וראיין מתייסר, כי בכל אותו הזמן הוא רואה איך פיש מתייסר, דחוס באקווריום הקטן שלו, שהיה פעם גדול. בסוף אמא סוגרת עם המוכר על מחיר שמרצה את שניהם, והמוכר מכניס את פיש לאקווריום גדול יותר, בו בטוח יהיה לו מקום לזוז. כולם שמחים, ובמיוחד ראיין - וודאי שגם פיש.  
אבל פיש לא שמח להרבה זמן, כי בדיוק לאחר שבוע – הסיטואציה חוזרת על עצמה. פיש גדל וגדל בכל יום מימות השבוע, ובסופו מגיע למימדים שלא אפשרו לו לזוז כלל בתוך האקווריום.
"זה לא הגיוני מה שקורה כאן!" אמרה אימו של ראיין.
"אפשר לאכול אותו." הציע אביו.
"אולי אפשר לשים אותו בקרקס." תמהה אחותו של ראיין. 
אחיו הקטן של ראיין לא העז להתקרב לאף חלק בבית שבו היה נמצא פיש. מה שאמר שהוא הסתגר בחדרו ברוב הימים. 
וראיין, הוא פשוט חשב שאפשר לפתור את הבעיה על ידי קנייה של אקווריום גדול יותר.
"ואם הוא ימשיך לגדול?" אמא שאלה. 
אז נקנה אחד גדול יותר!
"ואם הוא ימשיך לגדול?" 
אז גדול יותר! 
"ואם עוד?" 
אז גדול גדול גדול עד אינסוף!
"לא." אמא קבעה. "זה יותר מדי כסף. אני מצטערת ראיין אבל אנחנו מחזירים אותו למוכר הנחמד. תגיד שלום יפה לפיש."
ראיין בכה והתמרד ולא הסכים עם שום דבר שאימו אמרה, אבל בסופו של יום, כשהוא הביט בעיניו העצובות של פיש וראה איך הוא סובל מחוסר התזוזה והמחנק, הבין שהיא צודקת. 
פיש הוא דג מיוחד. הוא נועד לגדולות - לא לאקווריומים ביתיים קטנים. 
הוא אמר לו יפה שלום דרך הזכוכית ואמר שהוא יתגעגע, וביום המחרת הם החזירו את פיש למוכר הדגים שגירד את פדחתו ולא זכר בכלל שאי פעם היה לו דג כזה, בטח לא אחד עם כתם שחור לבן על הגב ובטח לא אחד שגדל בקצב שכזה. 
אבל המוכר היה מאוד שמח, כי ברגע שראה שהבעיה של פיש אכן אמיתית, הבין שיש כאן פוטנציאל כספי גדול מאוד.



פרק ארבע – פיש והעולם. 

בתקופה הזאת של חיו, פיש היה מבוהל. 
מי הם כל האנשים האלה? מה הם רוצים ממני? הוא תהה. 
הוא לא הצליח להבין למה ממשיכים להעביר אותו ממיכל אחד לאחר ולמה הוא כבר לא יכול לברוח מהרשת, שבעבר היה כל כך קל לחמוק ממנה. 
היום הוא בקושי יכול לזוז. והדגים הענקיים האלה שחיים יחד איתו, מפחידים אותו נורא. 
אבל הפחד של פיש מן הדגים נעלם תוך פרק זמן קצר במיוחד, שכן במהרה  מימדיו מתעלים על הגודל שלהם ושמים אותו באקווריום ענק ונפרד. 
אם פיש היה יודע קרוא וכתוב הוא היה מבין שהשילוט הענק בכניסה מכריז: "דג הפלא! בואו וראו!" ואם הוא היה מבין את ההגיון האנושי הוא היה קולט שכל האנשים האלה באים לראות אותו שוב ושוב, כדי להיווכח במו עיניהם שהדג הזה הקרוי פיש באמת רק ממשיך וממשיך לגדול. 
והאוכל! כמה הוא אכל. הוא היה צורך כמויות אדירות של מזון. כמויות עצומות ממש! הוא אכל ואכל, ונדמה היה שלעולם לא יפסיק לאכול. והוא גדל וגדל - ובמהרה אפילו האקווריום הענק לא הספיק לו. 
יום אחד פיש ראה קבוצת אנשים מתקרבת אליו ומביטה בו בסבר פנים חמור. 
הם אמרו למוכר הדגים, שכבר לבש חליפה מהודרת וחייך תמיד, שהם רוצים לקנות את פיש. שהם רוצים לחקור אותו. מוכר הדגים התנגד בכל תוקף, צרח ממש, אבל כששמע באיזה סכום מדובר ושהמחקר זמני, השתכנע. הם
לחצו ידיים, ובמשך יום שלם חברו להם עשרות פועלים כדי להעביר את פיש מהאקווריום הענק, לצפון המדינה למכון ביולוגי, שם חקרו אותו. 
חקרו אותו במשך ימים ושבועות ושנים. חקרו אותו עד שפיש עצמו כבר כמעט ולא פחד ממה שקורה. הוא הרגיש שראה הכל וחווה הכל. הרשת תמיד מעבירה אותו למקום חדש, ואנשים תמיד מסתכלים, ואנשים תמיד מאכילים, וחוזר חלילה. הכל תמיד אותו הדבר. 
החוקרים הצליחו להגיע למסקנה הנחרצת - "מדובר במקרה ייחודי ביותר." ולאחר מכן דנו בעיקר בשאלה מה לעשות עם הדג הזה שרק ממשיך לגדול. 
היו כאלה שהציעו להרוג אותו, שכן נדמה היה שלא יפסיק לגדול לעולם וצריך לגאול את החיה המסכנה מייסוריה, ותחשבו כמה אנשים אפשר להאכיל בו. אבל פיש הפך להיות במרוצת השנים לתופעת טבע של ממש, והיו לו מעריצים ותומכים ואוהדים וסוגדים, ואי היה אפשר להרוג אותו סתם כך.
לאחר התייעצות עם גורמים בכירים, הם החליטו לשחרר אותו לטבע, לאגם של מים מתוקים אי שם בדרום הארץ. 
"ומה נעשה אם הוא יהיה גדול יותר מהאגם?" שאל אחד מן המדענים הספקנים. 
"הוא לא יהיה גדול יותר מהאגם. אל תשמע מגוחך בבקשה." ענו לו כל השאר. 
"אבל מה אם הוא יהיה?" התעקש אותו ספקן. 
"הוא לא, הוא ימות מזקנה עד אז." ענו כל השאר. 
"ומה אם הוא יהיה?" המשיך להתעקש. 
"אז, אנחנו בבעיה."


פרק חמש – פיש והמוות.

התחזיות של המדען הספקן התגלו כנכונות. 
פיש פשוט המשיך לגדול, והגיע למימדים עצומים ולא הגיוניים, ולמצב בו מבנה הגוף שלו והעצמות בפרט כבר לא היו יכולים לתמוך בשרירים העצומים ובמסה הכבירה שלו. הוא צמח אל על והיה נראה כמו הר בתוך האגם הגדול, ורק בקושי הגיעו מים לזימיו בשביל אוויר לנשימה. 
פיש סבל באופן תמידי, ואף אחד לא ידע מה לעשות איתו. הוא היה עצום מדי בשביל להעבירו לאגם גדול יותר – וגם אם המשימה תצלח, היה כבר ברור לכולם שהבעיה לא תיפטר. 
אנשים ביקרו את אגם זה במשך כל תקופת שהייתו של פיש, וקראו לאגם על שמו והניחו נרות וביכו וספדו והתענו כאילו קיבלו את גורלו, ובאמת היה קשה שלא לחשוב שימות בזמן שהסתכלת עליו נושם באיטיות, כאילו כל נשימה היא מאבק קשה וסופני עבורו. 
הצבא שקל לארגן משלחת של עשרה מסוקים שיניעו רשת ענק, וצוות של כמאה חיילים וצוללנים שידאגו לרתום אותו כמו שצריך, וכך להעבירו למקום אחר. 
זה לא שמפקד הצבא חשב שההעברה תהיה מועילה לפיש, הוא פשוט חשב שזו הדרך הטובה ביותר להיפטר משאריותיו לאחר שימות. 
עד סוף ימי חיו, ביקרו את פיש מיליוני אנשים מהעולם, מכל המינים והסוגים. מכל הדתות, מכל התרבויות ומכל קבוצות הגילאים. 
הפאנטים ההדוקים ביותר, וגם השונאים המושבעים ביותר - כולם ביקרו את פיש. אם חיית בעולם זה ולא ביקרת את פיש הדג - הרי שלא ידעת חיים מהם. 
ומבחינתו של פיש, כל זה לא שינה דבר. כל אדם שהגיע לאגם היה זהה בעיניו. הוא לא ראה שום הבדל בין בני האדם השונים, אפילו לא בין איש שחור קירח וחסון מאפריקה לבין נערה לבנה עם רעמת שיער וצנומה מאמריקה. הם כולם באו וכולם הלכו ואף אחד מהם לא היווה לפיש יותר מפרצוף חולף, זיכרון ישן ונוסטלגי לכל האנשים מהם הוא פעם פחד. 
היום הוא עצום וחזק ולא ירא מדבר. פיש יכול לומר באמת ובתמים, שכבר ראה וחווה הכל. 
אך מבין כל האנשים החולפים האלו, פיש זוכר שניים. 
הוא זוכר את מוכר הדגים שפרש כבר לגמלאות וגידל כרס. הוא בא אל פיש וטפח לו כמה פעמים על הצד ואמר, "מזל שהאמא והילד ההוא הביאו לי אותך. אתה ואני היינו שותפים טובים. אני מקווה שתגיע לגן העדן של הדגים." 
את האדם השני אותו הוא זוכר, איך לא, זה ראיין הילד, שכבר לא היה כל כך ילד. ״אני כבר בן עשר!״ אמר לו בהתלהבות בפעם הראשונה שביקר את פיש באגם.
תריסר פעמים ראיין ביקר אותו, ובכל פעם ביקוריו הפכו נואשים יותר. עצובים יותר. בכל פעם ראיין ראה כיצד חייו של פיש הולכים ונעלמים, והרגיש רע - ועל כן ידע שגם פיש מרגיש רע. 
בביקורו האחרון של ראיין הוא התקרב אל פיש בזהירות, פרש את ידיו לצדדים ומתח את גופו כמה שרק היה יכול, וניסה לחבק את פיש כמה שיותר. 
"בבקשה אל תמות פיש, אני אוהב אותך." הוא אמר לו. ודמעה אחת זלגה מפניו,  מכתימה את גופו של פיש.  
לפיש זה הרגיש מוזר, כי זו הייתה הפעם הראשונה בה הוא חש שאדם מקרין לו רגש כה טהור, זך ותמים ואמיתי. פיש הסתכל עליו, על הילד שאהב אותו ורק רצה באושרו, והרגיש טוב פתאום. 
פיש אמר לילד, "טפס עליי." 
וראיין מצמץ כמה פעמים, והביט מעלה, עיניו מתרחבות בפלא שלא יאמן. 
״מה אמרת?" הוא שאל.
"אמרתי שתטפס עליי. עד למעלה.״
ראיין לא הבין למה פיש רוצה שהוא יטפס עליו ולא הבין כיצד פיש יכול לדבר, אבל הוא בהחלט התכוון לכבד את הבקשה האחרונה שלו.
הוא התחיל לטפס, אבל הגוף של פיש היה חלקלק והוא לא הצליח לעשות צעד אחד עליו. אחרי כמה ניסיונות כושלים פיש אמר, "חזק. אל תפחד להכאיב לי, כאב לא רלוונטי. תנעץ את רגלייך בתוכי, חלץ נעליים." 
וכך ראיין עשה. הוא חלץ את הנעליים ונעץ עמוק את הרגליים בעורו הרך ובבשרו הגמיש. 
הוא התחיל לטפס, אבל בדיוק אז אימו ראתה אותו ומיהרה לתפוס אותו וכולם אמרו לו,
מה זה, מה אתה עושה לפיש המסכן?
אבל ראיין לא ויתר. הוא התנער מאימו והתחיל לטפס שוב ושוב, ובכל פעם עשה זאת במהירות הולכת וגוברת, ופעם הרביעית הוא טיפס כל כך מהר וגבוה שכבר אי היה אפשר לאחוז בו. 
כל האנשים הסתכלו עליו, ורק קיוו שפיש יסלח לנער המסכן שמחלל את גופו כך. 
ראיין טיפס טיפס, מעלה מעלה עד שהגיע לפסגה. מכאן, הוא ראה את כל האנשים כצעצועים קטנים המתרוצצים הנה והנה. 
לאן הם מתרוצצים? אי היה אפשר לדעת מגובה שכזה. 
״אף אחד גם לא יודע את התשובה שם למטה,״ פיש אמר לו. 
״אתה - אתה יכול לקרוא לי את המחשבות?!״ ראיין היה המום. 
״כן. אני יכול לקרוא את אלה הקרובים אליי.״ 
ראיין הסתכל על פיש כמעט ביראה ושאל, "מה עכשיו?"
"השחור לבן שעל גבי מתקלף." פיש אמר. 
ראיין ניגש אל הכתם השחור לבן וכרע ברך. הוא הניח יד אחת על החלק השחור ומשש, וגילה שהכתם השחור יוצא, כאילו היה מעין מרקם רך שפשוט הוסיפו לגופו של פיש. הוא החל להוציא את השחור עוד ועוד, עד שלא נשאר ממנו דבר. 
הוא עבר אל הלבן, ושם זה שונה. שם קשה להוציא את המרקם, והוא צריך לעבוד קשה. לקראת החצי פיש אומר לו, "אתה לא חייב לסיים את התהליך." אבל ראיין מתעקש וממשיך וחופר ומוציא, עד שלא נשאר דבר גם שם. 
עיניו נפערות כשהוא רואה מה יש בפנים. בריכה קטנה ובתוכה עובר, משהו שנראה כמו גרסא מיניטורית של פיש, גם הוא עם כתם שחור לבן על הגב. 
"שחרר אותו לאגם." אומר פיש. "ואחרי זה עשה משהו נוסף."
ראיין לוקח את הדגיגון בשתי ידיו, וזורק אותו מההר הלא הוא פיש, ורואה כיצד הוא נופל מטה מטה. אי אפשר לראות כמעט את הפגיעה במים. 
"גם הוא יגדל כמוך, בלי סוף?" שואל ראיין. 
"לא." פיש משיב. "אני אחד ויחיד."
"ממתי אתה יכול לדבר?" ראיין שואל אותו. 
"מאז שהדג התחיל לצמוח בתוכי." פיש אומר. "עכשיו אני צריך שתישן בתוכי, ילד."
"לישון?" 
"כן, בחלק שהיה פעם שחור."
"לכמה זמן אני צריך לישון שם?"
פיש שותק לכמה רגעים ואז משיב, "לתמיד."
ראיין נושם ומסתכל על פיש, ואז מסתכל מטה אל כל האנשים הקטנים. הוא לא מצליח להבין בדיוק מה זה אומר.  ״אני יכול לומר שלום לאמא?" הוא מבקש רשות. 
נדמה שפיש נאנח. "מהרגע שהוצאת את הדג ממני, נגזר עליי למות. אם תרד אליה לא תספיק לעלות לפני המוות שלי, ואז יהיה מאוחר מדי."
"מה יקרה אחרי שאני אלך לישון?" ראיין מסתקרן. 
"אתה תראה." פיש אומר. "אתה תראה הכל דרך עיניי." 
ראיין חושב על זה ארוכות. זו החלטה קשה עבור ילד בן עשר. אבל בסוף הוא מבין שאם עלה עד כאן, הוא גם מוכן לישון בשביל פיש לתמיד. אמא תסלח לו. אמא תבין - כי ראיין מבין. 
הוא ניגש אל החלק שהיה פעם שחור, מכניס רגל אחת ועוד אחת, ונשכב בפנים בתנוחה עוברית. 
דבר לא קורה בדקות הראשונות וגם לא בשעות הראשונות. 
ראיין נרדם בתוך פיש, ופיש לאט לאט מת. 
כשגופו מפסיק לתפקד, החומר השחור מתגבש אט אט סביב ראיין, ועד שמגיעים צוותי ההצלה כדי להציל את הילד שטיפס על פיש הם כבר לא מוצאים אותו כי החומר השחור כיסה את כולו. 
וברגע שזה קורה, החלק שהיה פעם לבן התחיל לזהור, וכך גם עיניו של פיש. 
כל האנשים הקטנים מטה קראו קריאות תדהמה, אימה ויראה בשעה שהיו עדים לכך. 
קריאותיהם נהפכו לצעקות, תפילות והודיות, בזמן שהם ראו את פיש מתחיל לזוז. 
האתאיסטים הכופרים ביותר החלו להאמין, כשראו את גופתו של פיש נעה מעלה, ומתחילה להזיז את הסנפירים בתנועות שחייה. 
פיש שחה, מעלה מעלה, ולא עצר. 


פרק שש – פיש והיקום. 

פיש שוחה מעלה מעלה, וראיין שוחה בתוכו ונדהם. פיש עוזב את האטמוספרה ואת גבולות כדור הארץ, וממשיך לשחות ולשחות, אל השחור שהוא היקום ואל אינספור השמשות והגלקסיות המאירים מכל עבר. 
ראיין מוקסם והוא צועק, "פיש! במשך כל הזמן הזה רצית לשחות בחלל?!"
פיש צוחק. "לא בדיוק אבל ידעתי שזה הייעוד שלי, וכעת גם הייעוד שלך. זהו המקום היחיד בו אני יכול לשחות בחופשיות וללא גבולות. היקום הוא אינסופי."
"וואו," ראיין קורא. "לאן אנחנו שוחים?"
"נשחה להרבה מקומות. נשחה אל חורים שחורים ואל ענקים אדומים וננסים לבנים. נראה גלקסיות מתנגשות ומתפוצצות במחזה אדיר הנקרא סופרנובה ונראה איך הזמן עצמו מתכופף אל מול כוח הכבידה העצום של הקוויזרים. יש לנו את כל הזמן שביקום לחקור את כל פינות העולם, ותפקידים גדולים למלא."
״מה זה, פיש! מאיפה אתה יודע את כל הדברים האלו?״
פיש מחייך, חיוך כמעט נוסטלגי. ״חייתי הרבה זמן וראיתי המון דברים ולמדתי אינספור נושאים. אני מניח שבערך בשלב הזה הדג נוצר בתוכי... בשלב בו מאסתי בכם, בני האדם.״
"מאסת? מה זה אומר? אנחנו לא חוזרים, פיש? אתה לא אוהב אותנו יותר?"
״אני אוהב. אבל גם אתה תראה, כשהזמן יחלוף, כיצד אותם דברים החוזרים על עצמם, יום אחר יום, שעה אחר שעה - או במקרה שלנו, שנת אור אחר שנת אור, מתחילים להישחק ולהימאס. הבנתי שאתם לא יכולים לספק לי דבר חדש... שמעתה, הכל יחזור על עצמו. הבנתי שאין לי לאן לשחות יותר בפלנטה שלכם. עם ההבנה הזאת הגיעה ההמתנה - לך, ילדי היקר. כעת, אני שוחה יחד איתך אל מחוזות חדשים שטרם נחקרו. אל הבטחות חדשות. ״
ראיין החל להילחץ. "מה, אבל מה אם תמחץ את כדור הארץ בכל הטיולים האלה בטעות?!"
פיש צוחק. "אל תדאג. אין גבולות לאקווריום הזה. תמו הימים בהם הצטרכו לפנות אותי עם איזו רשת, כי אני תופס יותר מדי מקום."
"בטוח?" 
"בטוח."
ראיין מחייך, והוא עוצם עיניים ונרדם בתוך פיש. הוא עדיין לא מבין מה כל זה אומר ואם הוא יראה שוב את אמא, אבל הוא מאושר ושמח וסקרן לגבי כל הדברים שפיש אמר.
וכעת, הוא גם יודע לומר באמת ובתמים שפיש מאושר, כעת כשאין לו שום גבולות. 
`;

export const ACTIVE_TEXTURAS_MOCK = [{}, {}, {}, {}, {}, {}];
